date
ct
chest
wo
contrast
clip
number
radiology
reason
please
eval
loculated
pleural
effusion
right
field
view
underlying
medical
condition
year
old
woman
ho
rul
subtotal
resection
lung
ca
well
lll
superior
segment
tb
presents
rll
pna
parapneumonic
concerning
empyema
examination
place
pigtail
catheter
send
fungal
asap
pt
may
require
later
final
report
indication
previous
history
cancer
prior
left
lower
lobe
tuberculosis
currently
represents
pneumonia
peripneumonic
assess
evidence
scans
available
comparison
helpful
delineating
stability
postoperative
abnormalities
patient
helical
thorax
performed
without
intravenous
oral
administration
images
acquired
mm
collimation
reconstructed
intervals
assessment
soft
tissue
structures
reveals
numerous
surgical
clips
perihilar
paramediastinal
area
small
dependent
present
moderate
sized
significantly
components
predominantly
anteriorly
laterally
hemithorax
although
administered
precluding
enhancement
surface
appear
slightly
rind
surrounding
fluid
addition
lateral
note
made
additional
posterior
extending
azygoesophageal
recess
hounsfield
units
measurements
within
heart
enlarged
pericardial
evident
several
mediastinal
nodes
less
cm
greatest
short
axis
dimension
meet
strict
criteria
abnormal
enlargement
hilar
limited
due
change
lack
suggestion
lymph
node
imaging
upper
portion
abdomen
significant
abnormality
liver
spleen
organs
completely
imaged
study
adrenal
glands
included
exam
cont
lungs
extensive
linear
opacities
apices
probably
reflecting
scarring
sharply
marginated
areas
increased
opacity
region
traction
bronchiectasis
noted
reflect
postradiation
wedgeshaped
groundglass
seen
peripherally
base
opacification
thickened
septal
lines
adjacent
also
patchy
consolidation
multiple
bandlike
additionally
two
nodules
abutting
one
measuring
diameter
contains
band
like
calcium
dominant
masses
airways
narrowing
bronchus
intermedius
respiratory
component
obstructing
airway
lesions
identified
parenchymal
calcification
finally
nodular
extreme
skeletal
deformities
ribs
surgery
suspicious
lytic
blastic
impression
moderatesized
multiloculated
peripheral
diffuse
keeping
reactive
follow
treatment
acute
infectious
process
would
ensure
resolution
probable
changes
related
partially
resected
difficult
evaluate
residual
disease
absence
older
films
setting
infection
possibly
site
nonspecific
motion
time
thin
section
suggested
better
help
distinguish
benign
granulomas
foci
metastatic
granulomatous
possible
given
emphysema
apparent
addendum
clinical
provided
patients
bronchoalveolar
cell
could
potentially
carcinoma
appearance
antibiotic
therapy
pm
cta
wwo
recons
non
ionic
pe
loculation
admitting
diagnosis
cancershortness
breath
optiray
amt
man
cycles
chemotherapy
needs
tail
contraindications
iv
wet
read
dfddp
mon
changed
worsening
bilateral
pulmonary
new
technique
mdct
contiguous
axial
bases
obtained
cc
nonionic
secondary
rapid
bolus
requirement
needed
per
protocol
coronal
sagittal
reconstructions
arterial
vasculature
visualized
segmental
branches
filling
defects
great
vessels
normal
limits
trace
demonstrated
pathologically
axillary
anterior
medial
thickening
since
rim
stable
pleura
near
diaphragm
interval
development
window
demonstrate
ground
glass
middle
air
bronchograms
findings
suggestive
multifocal
patent
level
bronchi
bilaterally
likely
radiation
thyroid
demonstrates
kidneys
stomach
bone
windows
sclerotic
grade
suggest
relatively
enhancing
embolism
chf
effuision
elevated
ddimer
creat
ro
mipneumonia
effusions
days
improvement
status
consolidations
cannot
get
poor
renal
function
baseline
yo
despite
material
decubitus
marked
increase
size
high
density
distal
parenchyma
lobes
side
greater
described
associated
persistent
aortic
coronary
artery
calcifications
paracardial
views
layering
large
show
aerated
portions
many
central
pneumothoraces
placement
percutaneous
gastrostomy
tube
portal
venous
system
otherwise
unremarkable
post
cholecystectomy
pancreas
degenerative
osseous
hardware
overlying
lumbar
vertebral
bodies
vs
atelectasis
scattered
presence
bronchial
wall
represent
asymmetric
edema
congestive
failure
however
excluded
correlation
recommended
hepatic
tracking
concern
mesenteric
ischemia
warranted
rule
possibility
finding
discussed
dr
last
name
stitle
throughout
pelvis
pulm
rp
bleed
altered
mental
asperigillous
malt
mrsa
cdiff
colitis
pw
fever
ms
wcont
resp
distress
bipap
pupil
dilated
responsive
light
crit
drop
arf
problems
including
aspergillosis
diff
hematocrit
recent
cardiac
catheterization
nonoral
noniv
compared
previously
dense
calcified
hilum
lymphadenopathy
lymphoma
interstitial
worsened
aorta
sided
picc
staples
along
internal
mammary
arteries
prosthetic
breast
implants
nasogastric
terminating
punctate
unchanged
discrete
noncontrast
highdensity
gallbladder
vicarious
excretion
notable
cortical
medullary
appears
intact
retroperitoneal
hematoma
amount
bowel
loops
definite
dilute
bladder
foley
nondependent
introduced
uterus
retroverted
iliac
island
healed
rib
fracture
seventh
subcutaneous
tissues
worse
interim
aspect
anasarca
urinary
collecting
preliminary
first
image
interpretation
approximately
wcontreconstruction
empyeme
acut
sob
afib
hx
shortness
atrial
fibrillation
selected
fast
multiplanar
good
circulation
arch
dissections
consistent
known
space
bubbles
reduction
mediastinum
pneumothorax
except
intra
intralobular
volume
overload
grossly
endotraacheal
tip
carina
wedge
granuloma
centrilobular
remaining
fields
appropriately
placed
results
ordering
physician
person
ctaassess
tachypnea
hypoxia
ese
nondiagnostic
infiltrates
used
reformatted
planes
breathing
appreciated
main
collapse
aspiration
background
portable
ap
pneumonias
radiograph
dated
essentially
bronchogram
zone
basilar
month
reviewing
xray
overall
multilobular
ett
appropriate
position
current
myeloma
myloma
sp
auto
bmt
spiking
fevers
infiltrate
indications
marrow
transplant
helically
evaluation
prominent
artifact
single
bibasilar
representing
ruled
definitively
remain
smaller
sternal
wires
apex
lowattenuation
cysts
characterized
progression
appearing
involvement
presumed
sepsis
hypercalcemia
resolving
temporary
pacing
wire
hypotension
treated
dopamine
wbc
count
temp
spikes
chronic
insufficiency
scan
sources
pacer
white
temperature
priors
lowdensity
located
primarily
endotracheal
prevascular
pretracheal
none
pathologic
endobronchial
lesion
ventricle
negative
doctor
adenoma
symmetric
extrarenal
hyperdense
focus
stone
hydronephrosis
colon
intraabdominal
abscess
free
diverticula
involving
descending
sigmoid
diverticulitis
pelvic
displays
phleboliths
femoral
line
droplets
superficially
procedure
diverticulosis
fibrosis
etc
lelbow
fractur
female
question
versus
comparisons
shoulder
fractures
pins
axilla
pathology
largest
measures
ascending
esophagus
predominance
slight
sparing
low
tiny
stones
milk
simple
cyst
kidney
vascular
uip
dilatation
suggests
typical
sarcoid
considering
cardiomegaly
humerus
humeral
head
wcontrast
reconstruction
nhl
weakness
retroperitoneum
temps
dyspnea
initial
cxr
repeat
showed
intersitial
orthostatic
nonhodgkins
lowgrade
showing
picture
depletion
following
admistered
nature
next
reveal
suboptimal
embolus
regions
compression
ill
defined
periphery
inflammatory
ago
compressive
biliary
tract
intrahepatic
ductal
pulmnary
mulitple
pneumobilia
uncertain
etiology
instrumentation
ercp
recently
passed
gallstone
quadrant
ultrasound
opti
ardspneumonia
pneumonic
thoracic
inlet
supine
positions
gas
unclear
whether
septations
minimal
rightward
shift
pericardium
borderline
paratracheal
subcarinal
circumscribed
attenuation
structure
somewhat
rounded
pole
pockets
destruction
worrisome
cavitary
necrosis
lesser
evaluatedconfirmed
dedicated
nonurgent
basis
br
abx
wish
thanks
improving
antibiotics
risk
factors
biapical
entire
resections
focal
consolidative
lingula
bullae
clear
undergone
mastectomy
dissection
gross
consolidated
infectiousinflammatory
differential
include
pneumonitis
lymphangetic
spread
tumor
andor
pathol
admitted
copd
exacerbation
series
nodule
mucoid
impaction
mild
retained
secretions
proximal
trachea
softtissue
metallic
densities
remains
stripe
suggesting
incompletely
incidentally
early
developing
bronchopneumonia
separate
zones
consider
followup
order
determine
thoracentesis
multilobar
yesterday
beyond
subclavian
vein
brachiocephalic
superimposed
vascularity
indistinct
obstructive
mass
smallcell
paratrachealhilar
compressing
stem
causing
stenosis
compresses
still
veins
lobectomy
evaluated
hypodense
characterize
gallstones
cholecystitis
depicted
aspects
larger
especially
todays
spine
obscuring
rsv
spiked
today
look
superinfection
smallto
fissure
cabg
bones
diffusely
mottled
junction
atrium
vena
cava
airspace
upon
pa
lat
myelomastatus
rhonchi
upright
frontal
increasing
contours
rightsided
dobbhoff
type
feeding
ards
intubated
extubation
adrenals
injection
subcentimeter
leftsided
progressed
organizing
raises
drug
reaction
amiodarone
toxicity
potential
cause
trach
icu
pl
mvrtvr
vats
male
tracheostomy
sternotomy
indicating
median
jugular
svc
mitral
valve
tricuspid
ventricular
improved
ev
persistant
call
oxygen
illdefined
reticulation
configuration
review
precarinal
similar
mildly
hypodensity
reflects
another
observed
posteriorly
gynecomastia
diagnostic
considerations
pseudomonas
developed
boop
pattern
pain
age
pressure
htn
yearold
hypertension
use
swanganz
passes
branch
terminates
device
overlies
lead
apparently
meeting
confluent
dimensions
atrophic
periportal
stranding
fully
metastases
bronch
doe
bronchoscopy
volumes
decreased
depressions
quadroplegia
suspected
mid
cross
prominence
continued
give
esrd
hd
suspicion
presenting
endstage
presented
display
plane
reaccumulation
across
loss
lobular
paraspinal
ascites
abdominal
destructive
vertebrae
sternum
clavicles
scapula
myelomatous
partial
elements
body
lingular
clinically
mr
degree
exclude
extension
spinal
canal
staff
caring
dictation
intubation
ng
ij
satisfactory
unfolding
redistribution
blurring
detail
retrocardiac
abd
pes
pancreatitis
incr
allogenic
lfts
cuts
best
fib
emboli
helicallyacquired
phase
delayed
rate
required
allowing
sizeable
subsegmental
treeinmale
un
llmited
prominently
distended
lastname
pericholecystic
granulomata
nephrograms
either
splenomegaly
splenic
rising
fibrillationpneumonia
blood
cts
peribronchial
goiter
ivc
atelectases
minor
osteopenia
hiatal
hernia
behind
aneurysm
innominate
lymphocytic
leukemiapneumonia
semiupright
day
earlier
compare
bypass
subtle
lucencies
shows
studies
source
wolframs
syndrome
mssa
requiring
adequate
antimicrobial
coverage
progressionresolution
wolfram
msa
pubic
symphysis
adenopathy
nonpathologically
complete
enhance
symmetrically
excrete
normally
ureters
seminal
vesicles
prostate
intrapelvic
cvl
cavoatrial
removed
ngt
largely
extent
removal
silhouette
bl
questionable
incidental
cholelithiasis
highattenuation
bony
pre
existing
communicated
initials
diseasechest
paincath
nstemi
myocardial
infarction
outside
hospital
multidetector
reformation
supraclavicular
confluence
medially
smoothly
plaque
major
measure
fullness
hila
replacement
retrocrural
least
scar
lobar
malignant
unilateral
weeks
neoplastic
hydrostatic
cystic
characterization
aaa
ruptur
ra
sudden
arrest
resucitation
rupture
critical
resuscitation
followed
angiogram
contrastenhanced
streak
lift
arm
intrathoracic
atherosclerotic
caliber
globally
annulus
pacemaker
defect
caudate
hydroureter
infrarenal
mural
thrombus
aneurysms
containing
obstruction
incarceration
rectum
adnexa
inguinal
fatcontaining
hip
levels
thoracolumbar
reformats
confirm
debility
positioning
collapseatelectasis
contusions
effort
global
resuscitative
efforts
pneumococcal
dz
collection
acutely
creatinine
collapsed
plaques
intraperitoneal
fat
collateral
multi
recommend
drainage
asbestos
exposure
house
ipf
res
honeycombing
poles
locucated
pod
cabgmvr
perform
ed
dcsc
sun
poss
effusionatelectasis
neck
diaphragms
medistinal
fatty
centers
valves
tracheal
tree
collections
righ
margins
borders
tracks
effusionempyema
expanded
nondistended
nonthickened
part
walls
though
interpreted
fu
film
stroketransient
ischemic
attack
seizures
seizure
faint
quality
eight
ninth
tortuous
cardiomediastinal
support
formation
subacute
injury
widened
common
bile
duct
transaminitis
edematous
ruq
us
acalculous
likley
origin
severe
atherosclerosis
nonhemorrhagic
enhances
hemangiomas
pedunculated
perisplenic
corresponds
hemangioma
thick
walled
radiopaque
cbd
peripancreatic
nonenlarged
gland
singlephase
statistically
contour
abscesses
malignancy
mildmoderate
deformity
edematousappearing
corresponding
correct
hida
moderately
mri
requested
reticulaton
biopsy
distribution
optimal
hypoxic
need
unenhanced
includes
bacteremia
initially
necessary
sshaped
scoliosis
causes
atelectatic
pathcy
et
postobstructive
cll
lf
pedicle
particularly
congestion
totally
spike
indistinctness
multilevel
compatible
pneu
hhistory
paf
comes
unresponsive
copious
hypotensive
appreciate
coiled
fundus
gastric
distention
cirrhosis
taken
hours
collapseconsolidation
progressive
ppneumonia
obtain
access
superolaterally
passive
narrowed
going
dome
pancreatic
fusion
rods
infected
prebronchoscopy
become
resulting
artifacts
limitations
apical
flex
suspended
inspiration
subsequently
according
lowdose
sequence
dynamic
expiratory
maneuver
data
create
reviewed
issued
lobulated
apicalposterior
markedly
narrows
maximal
mentioned
extrinsic
displacement
encases
necrotic
surrounded
regards
shortaxis
exophytic
remarkable
regarding
distortion
fissural
spiculated
noncalcified
tracheomalacia
sectional
expiration
nearly
bronchogenic
inflammatoryinfectious
morphology
raising
synchronous
primary
limitation
apicoposterior
decub
tappable
cad
even
antiobiotics
radiographs
ectatic
midtoupper
convex
simply
perf
processplease
gastrograf
ventral
flank
rash
gastrograffin
allergy
hypovolemia
willing
suspect
ctplease
allergic
signs
perforation
chestabdomenpelvis
mdctacquired
held
av
chain
interpolar
cavity
moderateto
identification
bowelcontaining
stool
decompressed
malignantappearing
occult
relate
emergent
septic
cant
occasionally
correlate
cultures
calculi
dw
unit
team
withdrawn
rotation
border
based
multiply
found
elective
tubes
obscuration
hemidiaphragm
aeration
chop
slowly
little
blunting
cp
angles
see
anything
resides
alveolar
longstanding
pls
paraseptal
oval
welldefined
sebaceous
indicate
cancersepsis
squamous
lul
rml
recurrent
location
cavitation
irregular
heterogeneous
debris
obliteration
emphysematous
second
infiltration
aspergillus
ventilatory
difficulty
ventilating
ventilator
angle
decadron
decr
sats
azm
tue
opacitites
audit
anatomy
hydropneumothorax
postsurgical
clearing
abrupt
cutoff
basalar
opactites
hairy
leukemia
pancytopenia
cough
respond
empiric
improve
course
allergies
xrays
fibroadenoma
round
mammogram
thickness
masslike
inferior
indeterminate
attentuation
prominant
rapidly
neutropenic
mucormycosis
leukemic
considered
much
esophagitis
pronounced
sutures
osteolytic
leukocytosis
scanning
conjunction
elsewhere
widespread
hemorrhage
lumen
appreciable
circumflex
layer
subdiaphragmatic
presumably
calcific
onset
mmbn
wed
liekly
stent
surrounds
intimal
flap
ulceration
extravasation
pleuralbased
detected
exchange
nonaggressiveappearing
attenuating
intraesophageal
intraductal
enterred
emergency
department
dashboard
distinct
procedural
service
haziness
latter
spontaneous
ptx
osh
sat
torso
smalltomoderate
bac
infectionaspiration
lt
mi
revised
originating
midportion
cardia
cardiopulmonary
processes
hyperplastic
projects
returns
point
returning
distally
tracheobronchial
malacia
constellation
symptoms
bronchiolitis
responsible
deviation
osteophyte
schmorls
spared
intermittent
tracheobronchomalacia
stabilized
extubated
entity
port
check
dl
pager
denser
successful
asthmacopd
persists
extends
projection
yesterdays
productive
water
inc
work
leads
leading
neutropenia
tuesday
dating
nonobstructing
wean
statuspneumonia
weaning
widening
quite
differences
tenderness
hiv
hcv
hbc
lft
elevation
thrombocytopenia
sobruq
dic
asthma
pcp
context
limit
looks
full
nodularity
pacs
combination
cephalad
relative
atypical
unusual
progress
pneumoniachf
tips
missing
clearly
heterogenous
dilation
effect
infarctionrenal
failureanemia
medications
immunosuppressive
sleeve
readmit
fevermalaise
elliptical
centrally
superiorly
accurately
delineate
orientation
expected
around
progressively
stiffer
costophrenic
sputum
semi
chemo
pheresis
pseudomonal
shock
organ
ventpt
tachycardia
lgf
multisystem
event
slower
inject
deep
thrombosis
thus
legs
minute
delay
knees
dependently
reactionary
yields
aid
extremities
commmon
superfiscial
popliteal
musculature
broad
listed
dvt
transferred
pic
ray
hyperinflated
flattened
indicated
muscle
back
hct
definitely
unopacified
throughut
requirements
exams
comparable
atelectasisconsolidation
young
ams
rotated
visualization
metal
plate
screws
po
evalua
inflammation
proximity
passage
thought
tubeline
advancement
paged
consolidaiton
project
feverro
indicative
recanalized
umbilical
prompt
antrum
paracolic
gutter
omentum
extraabdominal
effusionspleural
asbestosis
amounts
gutters
completed
antibioitc
vent
technically
exclusion
assessed
courses
adequately
technical
cervical
unk
vomiting
direct
unlikely
rather
explain
conclusive
examinations
telephone
referring
bilat
concerned
cardiophrenic
sulcus
comminuted
called
pat
dx
pneumo
bx
radiographic
kkxa
permits
bedside
markings
aids
hep
hyperglycemia
hepatitis
fluffy
lethargic
bp
perhaps
overt
crecons
noncoronary
bullous
thromboembolic
hazy
newly
thoracotomy
evalaute
milder
pneumoniafeversp
desats
intrabdominal
desaturations
precontrast
enhanced
wow
degraded
wiv
drain
exits
flow
perihepatic
subhepatic
wound
dehiscence
surgerydebridement
midline
innumerable
para
evolution
desaturation
loculate
inferiorly
midpole
postop
element
allergicdrug
decompensation
biventricular
echocardiogram
largesized
infrahilar
decrease
clavicle
cw
lies
reassess
positive
staph
resolved
poorly
advanced
effusionsinfiltrates
dual
chamber
situ
localized
cv
via
nausea
redo
avrhomograft
fungemia
sz
nv
intolerant
feeds
outlet
gj
infused
gtube
avr
jejunum
walledoff
different
phases
severity
crackles
neoplasm
engorgement
attributed
jr
mucus
plugging
duallead
persist
cr
remote
exertion
worst
sub
bacterial
ongoing
pnx
obscured
fine
positioned
ildacut
desat
interlobular
architectural
proper
demineralized
hemidiaphragms
catheters
community
mechanical
ventilation
obvious
sizable
homogeneous
majority
subpulmonic
streaky
lad
mixed
top
dobhoff
comments
erect
localize
mark
spot
tap
nonunion
unfolded
stage
swan
tachypneia
upward
necrotizing
describes
displayed
mainstem
impacted
aspirated
chestmediastinum
wgad
magnevist
wpna
unknown
etiol
echo
contributing
myxoma
heparin
pending
page
wwet
thanx
tesla
using
sequences
db
haste
cine
true
fisp
vibe
gadolinium
interauricular
septum
cooperation
hypercarbic
attn
overloadchf
og
postpyloric
pyloric
combined
angio
serial
statusinfiltrate
glioblastomadyspnea
cerebral
wworsening
tortuosity
vaguely
vague
decreasing
obscures
details
standard
half
advised
placements
esp
respect
cut
pneumoniavolume
hepatobiliary
lymphomafever
visapaque
mantle
infarct
alk
phos
alkaline
phosphatase
multiphasic
visipaque
geographic
hypoattenuation
culdesac
perislenic
cul
de
sac
pneumoniahypoxia
met
panc
revealing
hyponatremia
siadh
tachypnic
ideally
timed
intraluminal
ventricles
pathologicallyenlarged
total
occlusion
filled
abovedescribed
aerosolized
long
hepatorenal
striking
ef
vx
persiste
extention
leg
utilizing
optimally
severely
kyphotic
consolidationcollapse
kyphosis
cancerfeverhypotension
tx
presumptive
nameis
lowlying
brachycephalic
permanent
thinwalled
bulla
attention
vertical
retraction
curled
silhouettes
suprahilar
lucency
gastroesophageal
perivascular
preceding
horizontal
remainder
hyperlucency
esld
conf
confirmation
readthanks
rasvc
massive
flexed
effucion
hypoxemia
verify
orogastric
oxygenation
infiltards
dialysis
stents
wards
reintubation
gram
cocci
asymmetrical
adenocarcinoma
rlung
mycoplasma
projecting
coursing
extravascular
mvr
unable
visualize
september
secretionsmucoid
toward
split
sign
beginning
plug
pvd
mucous
discoid
specifically
end
trauma
shaped
account
lymphangitic
damage
basal
sharp
svcra
lv
comment
olacement
home
track
vl
girth
encephalopathic
hyponatremic
bili
minimally
protein
state
subcm
mesentery
microbacterial
wide
midlung
semierect
decline
infiltrateptx
reticular
difference
pneumonectomy
respfailure
ardsepisodes
opacifications
ogt
appearances
expanding
document
preexisting
magnitude
three
cuff
inserted
rulrml
hole
ge
destroys
transverse
information
thoracocentesis
reexpansion
subpulmonary
blunted
fuo
confuent
anterolisthesis
febrile
processedemaeffusion
corticosteroids
reference
continues
sizerelative
bt
extremity
transfemoral
segments
postbronchoscopy
haze
dyspneacpw
pmh
dm
evalute
entirely
transvenous
withdrawal
plural
rij
trachesotomy
sideport
cuffing
di
slices
aquired
postadministration
atelectasisconsoldiation
third
spacing
cholecystostomy
pocket
cecum
therefore
confines
peritoneum
alternatively
rectus
abdominis
cecal
understand
received
steroids
iatrogenic
paracentesis
insertion
intensity
cavitating
palat
substantial
abgs
trached
bleeding
bruising
tomographic
sections
clinicians
request
cect
accompanying
longer
trv
anywhere
resorption
roughly
interspace
skin
interfascial
punctiform
commonexternal
arthroplasty
limiting
groins
consolidationatelectasis
contribute
case
evolving
chills
room
disoriented
midzone
episode
video
oropharyngeal
swallow
pharyngeal
paralysis
choking
coughing
eating
fluoroscopic
guidance
swallowing
liquids
pudding
cheerios
impaired
relaxation
esophageal
sphincter
valleculae
approx
insterstitial
axacerbation
viral
test
diuresis
platelike
mucuous
opacified
profoundly
lympoma
pressors
reidentified
capsule
example
conglomerate
hydroureteronephrosis
loop
nephrosis
hemipelvis
lymphomatous
duodenum
infiltrateconsolidation
preceeding
mostly
shadow
opacify
sounds
aureus
past
chin
lobectomies
ss
bs
abg
abcess
questions
answered
ulcer
femur
gluteal
gluteus
multiseptated
collectionabscess
exists
close
separated
sclerosis
si
joints
myositis
osifficans
approach
routine
rr
opacificationeffusion
extremely
sbp
fbr
occurred
overhydration
hrs
aspirate
jejunal
dudenal
wise
sinc
enov
reformations
hyperattenuating
peritoneal
outline
normalappearing
pneumatosis
cirrhotic
detailed
encephalopathy
hypoventilation
ascitespulm
txd
fn
paraduodenal
went
exlap
loa
overlie
various
supervening
inferolateral
ovoid
six
reintubated
infil
flare
rl
monitor
stably
asess
immediately
beneath
hemoptysis
night
embolis
utilized
limiited
receiving
mds
functionally
cva
flankabd
infections
flankabdominal
adnexae
barium
consistencies
visible
chinflexed
sure
abdomin
abdminal
repairs
gut
indicaation
filter
umblical
herniating
lumbosacral
eleventh
corticated
fragments
ischial
tuberosity
atelectasisconsolidations
prog
done
overloadinterval
diminished
pneumoniamucous
asp
radiologist
centesis
usclip
telephonefax
msra
therapeutic
revealed
risks
benefits
designated
power
attorney
informed
consent
chart
draped
sterile
fashion
gauge
yellowish
samples
laboratory
analysis
tolerated
requires
dainage
prepped
usual
lidocaine
local
anesthetic
accessed
needle
immediate
complications
attendance
ultrasoundguided
brachial
cephalic
direction
sinuses
restrictive
monitoring
devices
ileus
hypoactive
definitive
accumulating
possibilites
features
displacing